app/controllers/admin/customers_controller.rb

SELECT * FROM "customers" WHERE ("customers"."id" = 11)
---
  def show
    @customer = Customer.find(params[:id])

SELECT * FROM "customers" WHERE ("customers"."id" = 1)
DELETE FROM "customers" WHERE "id" = 1
---
  def destroy
    @customer = Customer.find(params[:id])
    @customer.destroy