app/controllers/admin/orders_controller.rb

  def edit
    @order = Order.find(params[:id])
---
SELECT * FROM "orders" WHERE ("orders"."id" = 6)

  def update
    @order = Order.find(params[:id])

    respond_to do |format|
      if @order.update_attributes(params[:order])
---
SELECT * FROM "orders" WHERE ("orders"."id" = 8)
UPDATE "orders" SET "updated_at" = '2010-01-14 17:07:32.791712', "pay_type" = E'cc' WHERE "id" = 8

  def destroy
    @order = Order.find(params[:id])
    @order.destroy
---
SELECT * FROM "orders" WHERE ("orders"."id" = 6)
DELETE FROM "orders" WHERE "id" = 6