app/controllers/admin/products_controller.rb

INSERT INTO "products" ("price", "created_at", "category", "photo_file_size", "title", "image_url", "music_file_name", "updated_at", "photo_file_name", "music_file_size", "photo_content_type", "music_content_type", "dl_url", "description") VALUES(0.99, '2010-01-19 18:37:30.646493', E'music', 374, E'foo12345', NULL, E'05_Viology.mp3', '2010-01-19 18:37:30.646493', E'notes.gif', 4928011, E'image/gif', E'audio/mpg', NULL, E'foo') RETURNING "id"
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT * FROM "products" WHERE ("products"."id" = 3)
UPDATE "products" SET "updated_at" = '2010-01-14 03:51:39.014439', "description" = E'foo123' WHERE "id" = 3
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])