app/controllers/admin/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "salt", "created_at", "updated_at", "hashed_password") VALUES(E'jay', E'21817262400.867087911078191', '2010-01-14 17:15:46.811438', '2010-01-14 17:15:46.811438', E'b96894d8850e1b2a811d855b94a7bc22b6ae05c6') RETURNING "id"

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
UPDATE "users" SET "updated_at" = '2010-01-14 20:53:54.576967', "salt" = E'21796219200.804599646037073', "hashed_password" = E'b1bba86707e3d429fd99dfec9eb34d722aaa60af', "name" = E'jay1' WHERE "id" = 2

  def destroy
    @user = User.find(params[:id])
    begin
      flash[:notice] = "User #{@user.name} deleted"
      @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
DELETE FROM "users" WHERE "id" = 1