app/controllers/admin_controller.rb

SELECT count(*) AS count_all FROM "users"
---
  def login
    if request.get? and User.count.zero?