app/controllers/customers_controller.rb

SELECT * FROM "customers" WHERE ("customers"."id" IS NULL) LIMIT 1
---
  def show
    @customer = Customer.find(session[:customer_id])

SELECT * FROM "customers" WHERE ("customers"."id" = 5) LIMIT 1
---
  def edit
    @customer = Customer.find(session[:customer_id])

INSERT INTO "customers" ("address", "salt", "created_at", "updated_at", "hashed_password", "last_name", "login", "first_name", "email") VALUES(E'sddfs', E'21820003000.813742600852488', '2010-01-13 04:13:29.808271', '2010-01-13 04:13:29.808271', E'9630bd3426d440877229dbda1bd8350fcfc88669', E'LaCarrubba', E'jayl5152@gmail.com', E'Jason', E'jayl5152@gmail.com') RETURNING "id"
---
  def create
    @customer = Customer.new(params[:customer])

    respond_to do |format|
      if @customer.save

SELECT * FROM "customers" WHERE ("customers"."id" = 5) LIMIT 1
UPDATE "customers" SET "updated_at" = '2010-01-15 21:52:26.300315', "email" = E'traci1@gmail.com', "salt" = E'21803303800.945214622084142', "hashed_password" = E'28f2c6bde2488a01c0636888db7a244f26634a12', "login" = E'traci1@gmail.com' WHERE "id" = 5
---
  def update
    @customer = Customer.find(session[:customer_id])

    respond_to do |format|
      if @customer.update_attributes(params[:customer])