app/controllers/line_items_controller.rb

SELECT * FROM "line_items" WHERE ("line_items"."id" = 5)
---
  def show
    @line_item = LineItem.find(params[:id])