app/controllers/orders_controller.rb

SELECT * FROM "orders" WHERE ("orders"."customer_id" = E'4') LIMIT 1
---
  def index
    @orders = Order.find_all_by_customer_id(params[:customer_id])

SELECT * FROM "orders" WHERE ("orders"."id" = 1)
---
  def show
    logger.debug "\norders_controller_show request_uri= #{request.request_uri}"
    session[:prev_uri] = request.request_uri
    @order = Order.find(params[:id])

SELECT * FROM "orders" WHERE ("orders"."id" = 8)
---
  def edit
    @order = Order.find(params[:id])

INSERT INTO "orders" ("created_at", "updated_at", "pay_type", "customer_id") VALUES('2010-01-14 02:13:58.686347', '2010-01-14 02:13:58.686347', E'cc', 4) RETURNING "id"
---
  def create
    @order = Order.new(params[:order])
    @order.customer_id = session[:customer_id]
    puts "\norder = #{@order}\n"
    respond_to do |format|
      if @order.save

SELECT * FROM "orders" WHERE ("orders"."id" = 8)
---
  def update
    puts "\nHUH?????\n"
    @order = Order.find(params[:id])

SELECT * FROM "orders" WHERE ("orders"."id" = 1)
DELETE FROM "orders" WHERE "id" = 1
---
  def destroy
    @order = Order.find(params[:id])
    @order.destroy