app/controllers/products_controller.rb

  def create
=begin
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("price", "created_at", "category", "title", "image_url", "updated_at", "dl_url", "description") VALUES(0.99, '2010-01-09 22:43:54.700877', E'music', E'song4', E'/images/notes.gif', '2010-01-09 22:43:54.700877', E'', E'some band''s song') RETURNING "id"

  def update
=begin
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT * FROM "products" WHERE ("products"."id" = 1)
UPDATE "products" SET "updated_at" = '2010-01-07 19:22:44.891781', "category" = E'music', "image_url" = E'foo.jpg', "price" = 0.01 WHERE "id" = 1