app/controllers/store_controller.rb

  def index()
    @current_time = Time.now.strftime("%Y-%m-%d %H:%M:%S")
    @products = Product.find_products_for_sale
---
SELECT * FROM "products" ORDER BY title

  def add_to_cart()
    product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 1)

  def checkout()

    puts "\nIN CHECKOUT\n"

    unless Customer.find_by_id(session[:customer_id])
---
SELECT * FROM "customers" WHERE ("customers"."id" IS NULL) LIMIT 1